In [ ]:
import pandas as pd
import numpy as np

ModuleNotFoundError: No module named 'requests'

In [ ]:
df=pd.read_json('../data/auto.json',orient='records')

In [ ]:
pd.options.display.float_format='{:.2f}'.format

In [ ]:
df

        CarNumber  Refund    Fines    Make    Model
0    Y163O8161RUS       2  3200.00    Ford    Focus
1     E432XX77RUS       1  6500.00  Toyota    Camry
2     7184TT36RUS       1  2100.00    Ford    Focus
3    X582HE161RUS       2  2000.00    Ford    Focus
4    92918M178RUS       1  5700.00    Ford    Focus
..            ...     ...      ...     ...      ...
720  Y163O8161RUS       2  1600.00    Ford    Focus
721  M0309X197RUS       1 22300.00    Ford    Focus
722  O673E8197RUS       2   600.00    Ford    Focus
723  8610T8154RUS       1  2000.00    Ford    Focus
724  H419XE197RUS       2  8594.59  Toyota  Corolla

[725 rows x 5 columns]

In [ ]:
sample = df[['CarNumber', 'Make', 'Model']].sample(n=200, replace=True, random_state=21).reset_index(drop=True)

sample['Refund'] = df['Refund'].sample(n=200, replace=True, random_state=21).reset_index(drop=True)

sample['Fines'] = df['Fines'].sample(n=200,replace=True, random_state=21).reset_index(drop=True)

sample

        CarNumber        Make   Model  Refund    Fines
0    Y351O8197RUS        Ford   Focus       1  1500.00
1     H917TC36RUS        Ford   Focus       2  4000.00
2    C589EY154RUS        Ford   Focus       1  4500.00
3     K846YE77RUS  Volkswagen  Passat       2  2000.00
4    X4108H125RUS        Ford   Focus       2  1300.00
..            ...         ...     ...     ...      ...
195  M942OT152RUS        Ford   Focus       1  2000.00
196  Y187O8161RUS        Ford   Focus       2   400.00
197  7064C8197RUS  Volkswagen  Passat       1 12800.00
198  8437XX154RUS        Ford   Focus       2   800.00
199   C410X938RUS        Ford   Focus       2  2200.00

[200 rows x 5 columns]

In [ ]:
concat_rows=pd.concat([df,sample])
concat_rows.index = range(len(concat_rows))
concat_rows

        CarNumber  Refund    Fines        Make   Model
0    Y163O8161RUS       2  3200.00        Ford   Focus
1     E432XX77RUS       1  6500.00      Toyota   Camry
2     7184TT36RUS       1  2100.00        Ford   Focus
3    X582HE161RUS       2  2000.00        Ford   Focus
4    92918M178RUS       1  5700.00        Ford   Focus
..            ...     ...      ...         ...     ...
920  M942OT152RUS       1  2000.00        Ford   Focus
921  Y187O8161RUS       2   400.00        Ford   Focus
922  7064C8197RUS       1 12800.00  Volkswagen  Passat
923  8437XX154RUS       2   800.00        Ford   Focus
924   C410X938RUS       2  2200.00        Ford   Focus

[925 rows x 5 columns]

In [ ]:
np.random.seed(21)
years = pd.Series(np.random.randint(1980, 2019, size=925))

In [ ]:
fines=pd.concat([concat_rows,years],axis=1)
fines = fines.rename(columns={0: 'Year'})
fines

        CarNumber  Refund    Fines        Make   Model  Year
0    Y163O8161RUS       2  3200.00        Ford   Focus  1989
1     E432XX77RUS       1  6500.00      Toyota   Camry  1995
2     7184TT36RUS       1  2100.00        Ford   Focus  1984
3    X582HE161RUS       2  2000.00        Ford   Focus  2015
4    92918M178RUS       1  5700.00        Ford   Focus  2014
..            ...     ...      ...         ...     ...   ...
920  M942OT152RUS       1  2000.00        Ford   Focus  1996
921  Y187O8161RUS       2   400.00        Ford   Focus  2002
922  7064C8197RUS       1 12800.00  Volkswagen  Passat  1996
923  8437XX154RUS       2   800.00        Ford   Focus  2012
924   C410X938RUS       2  2200.00        Ford   Focus  1984

[925 rows x 6 columns]

In [ ]:
popular_surname=pd.read_json('../data/surname.json')

In [ ]:
popular_surname.columns = popular_surname.iloc[0] 
popular_surname = popular_surname[1:].reset_index(drop=True)
popular_surname

0       NAME    COUNT RANK
0      ADAMS   427865   42
1      ALLEN   482607   33
2    ALVAREZ   233983   92
3   ANDERSON   784404   15
4     BAILEY   277845   72
..       ...      ...  ...
95  WILLIAMS  1625252    3
96    WILSON   801882   14
97      WOOD   250715   84
98    WRIGHT   458980   35
99     YOUNG   484447   32

[100 rows x 3 columns]

In [ ]:
k=fines['CarNumber'].nunique()
k

531

In [ ]:
surnames=popular_surname['NAME'].sample(n=k, replace=True, random_state=21).reset_index(drop=True)
surnames = surnames.str.replace(r'[^A-Za-z\s\-]', '', regex=True)
surnames

0      RICHARDSON
1            ROSS
2          MORGAN
3          BAILEY
4           LOPEZ
          ...
526      CAMPBELL
527          HALL
528         BAKER
529          DIAZ
530        MORGAN
Name: NAME, Length: 531, dtype: object

In [ ]:
cars=pd.Series(fines['CarNumber'].unique())
owners=pd.concat([cars,surnames], axis=1)

owners = owners.rename(columns={0: 'CarNumber'})
owners = owners.rename(columns={'NAME': 'SURNAME'})
owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    92918M178RUS       LOPEZ
..            ...         ...
526  O136HO197RUS    CAMPBELL
527  O22097197RUS        HALL
528  M0309X197RUS       BAKER
529  O673E8197RUS        DIAZ
530  8610T8154RUS      MORGAN

[531 rows x 2 columns]

In [ ]:
new_rows = [
    ['FK7362JG322RUS', 1, 7200.00, 'Hyundai', 'Solaris', 2016],
    ['US738G728RUS', 1, 1800.00, 'Porsche', 'Cayenne', 2012],
    ['AA837YH192RUS', 1, 6500.00, 'Hyundai', 'Accent', 2010],
    ['GJ123H3P128RUS', 1, 7400.00, 'Lada', 'Granta', 2014],
    ['KP341H177RUS', 1, 9200.00, 'Ford', 'Focus', 2015]
]

temp = pd.DataFrame(new_rows, columns=fines.columns)
fines = pd.concat([fines, temp], ignore_index=True)

fines

          CarNumber  Refund   Fines     Make    Model  Year
0      Y163O8161RUS       2 3200.00     Ford    Focus  1989
1       E432XX77RUS       1 6500.00   Toyota    Camry  1995
2       7184TT36RUS       1 2100.00     Ford    Focus  1984
3      X582HE161RUS       2 2000.00     Ford    Focus  2015
4      92918M178RUS       1 5700.00     Ford    Focus  2014
..              ...     ...     ...      ...      ...   ...
925  FK7362JG322RUS       1 7200.00  Hyundai  Solaris  2016
926    US738G728RUS       1 1800.00  Porsche  Cayenne  2012
927   AA837YH192RUS       1 6500.00  Hyundai   Accent  2010
928  GJ123H3P128RUS       1 7400.00     Lada   Granta  2014
929    KP341H177RUS       1 9200.00     Ford    Focus  2015

[930 rows x 6 columns]

In [ ]:
owners = owners[:-20]
owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    92918M178RUS       LOPEZ
..            ...         ...
506  T914CT197RUS   HERNANDEZ
507  E41977152RUS       BAKER
508  9464EX178RUS      MARTIN
509  O50197197RUS      WRIGHT
510  7608EE777RUS        HILL

[511 rows x 2 columns]

In [ ]:
new_rows = [
    ['SJ0273Y61RUS','RODGERS'],
    ['AP321E161RUS','JHONSONS'], 
    ['CS527Y161RUS','COOPERS']
]

temp = pd.DataFrame(new_rows, columns=owners.columns)
owners = pd.concat([owners, temp], ignore_index=True)

In [ ]:
owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    92918M178RUS       LOPEZ
..            ...         ...
509  O50197197RUS      WRIGHT
510  7608EE777RUS        HILL
511  SJ0273Y61RUS     RODGERS
512  AP321E161RUS    JHONSONS
513  CS527Y161RUS     COOPERS

[514 rows x 2 columns]

The new dataframe should contain only the car numbers that exist in both dataframes.

In [ ]:
pd.merge(fines, owners, on='CarNumber', how='inner').shape

(903, 7)

The new dataframe should contain all the car numbers from both dataframes.

In [ ]:
pd.merge(fines, owners, on='CarNumber', how='outer').shape

(933, 7)

The new dataframe should contain only the car numbers from the fines dataframe.

In [ ]:
pd.merge(fines, owners, on='CarNumber', how='left').shape

(930, 7)

The new dataframe should contain only the car numbers from the owners dataframe.

In [ ]:
pd.merge(fines, owners, on='CarNumber', how='right').shape

(906, 7)

In [ ]:
pd.pivot_table(fines, values='Fines', index=['Make', 'Model'], columns='Year', aggfunc='sum')

Year                   1980      1981      1982      1983      1984      1985  \
Make       Model
Ford       Focus   75494.59 307394.59 123394.59 164994.59 112500.00 271294.59
           Mondeo       NaN       NaN  46200.00       NaN       NaN       NaN
Hyundai    Accent       NaN       NaN       NaN       NaN       NaN       NaN
           Solaris      NaN       NaN       NaN       NaN       NaN       NaN
Lada       Granta       NaN       NaN       NaN       NaN       NaN       NaN
Porsche    Cayenne      NaN       NaN       NaN       NaN       NaN       NaN
Skoda      Octavia  8594.59   1900.00  10894.59       NaN    300.00   8594.59
Toyota     Camry   12000.00       NaN   7200.00       NaN   1000.00       NaN
           Corolla      NaN   6800.00       NaN  12800.00       NaN       NaN
Volkswagen Golf    20800.00   8594.59   5000.00    200.00    200.00 168000.00
           Jetta        NaN   1000.00       NaN       NaN       NaN   9000.00
           Passat    900.00   3000.00       NaN   1100.00   8594.59       NaN
           Touareg      NaN       NaN       NaN       NaN       NaN       NaN

Year                   1986      1987     1988      1989  ...      2009  \
Make       Model                                          ...
Ford       Focus   62200.00 166594.59 66178.35 166294.59  ... 150594.59
           Mondeo       NaN       NaN      NaN       NaN  ...       NaN
Hyundai    Accent       NaN       NaN      NaN       NaN  ...       NaN
           Solaris      NaN       NaN      NaN       NaN  ...       NaN
Lada       Granta       NaN       NaN      NaN       NaN  ...       NaN
Porsche    Cayenne      NaN       NaN      NaN       NaN  ...       NaN
Skoda      Octavia      NaN   2000.00  5100.00   9094.59  ...       NaN
Toyota     Camry   19800.00       NaN      NaN    800.00  ...       NaN
           Corolla      NaN  70300.00      NaN   7800.00  ...   8594.59
Volkswagen Golf         NaN       NaN      NaN   2600.00  ...       NaN
           Jetta        NaN       NaN 46000.00       NaN  ...       NaN
           Passat  16000.00   2000.00 20189.17       NaN  ...       NaN
           Touareg      NaN       NaN      NaN       NaN  ...   5800.00

Year                    2010      2011      2012      2013      2014  \
Make       Model
Ford       Focus   112600.00 117994.59 144589.17 283589.17 123683.76
           Mondeo        NaN       NaN       NaN  41100.00       NaN
Hyundai    Accent    6500.00       NaN       NaN       NaN       NaN
           Solaris       NaN       NaN       NaN       NaN       NaN
Lada       Granta        NaN       NaN       NaN       NaN   7400.00
Porsche    Cayenne       NaN       NaN   1800.00       NaN       NaN
Skoda      Octavia   2500.00   3000.00   1700.00  20394.59       NaN
Toyota     Camry    22400.00       NaN   7500.00       NaN       NaN
           Corolla   6000.00       NaN       NaN       NaN   6800.00
Volkswagen Golf          NaN       NaN       NaN       NaN  13900.00
           Jetta         NaN       NaN       NaN       NaN       NaN
           Passat    9500.00       NaN       NaN   1600.00       NaN
           Touareg       NaN       NaN       NaN       NaN       NaN

Year                    2015      2016      2017      2018
Make       Model
Ford       Focus   186000.00 131683.76 104194.59  83300.00
           Mondeo        NaN       NaN   8600.00       NaN
Hyundai    Accent        NaN       NaN       NaN       NaN
           Solaris       NaN   7200.00       NaN       NaN
Lada       Granta        NaN       NaN       NaN       NaN
Porsche    Cayenne       NaN       NaN       NaN       NaN
Skoda      Octavia  16394.59  35700.00   2400.00 161400.00
Toyota     Camry     7500.00       NaN       NaN  13000.00
           Corolla       NaN       NaN       NaN       NaN
Volkswagen Golf          NaN    300.00       NaN       NaN
           Jetta         NaN       NaN       NaN       NaN
           Passat        NaN       NaN       NaN       NaN
           Touareg       NaN       NaN       NaN       NaN

[13 rows x 39 columns]

In [ ]:
fines.to_csv('fines.csv', index=False)

In [ ]:
owners.to_csv('owners.csv',index=False)